dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_reg.h
/**
 * \file IfxCif_reg.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37xED_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Cif_Registers_Cfg Cif address
 * \ingroup IfxSfr_Cif_Registers
 * 
 * \defgroup IfxSfr_Cif_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Cif_Registers_Cfg
 *
 * \defgroup IfxSfr_Cif_Registers_Cfg_Cif 2-CIF
 * \ingroup IfxSfr_Cif_Registers_Cfg
 *
 *
 */
#ifndef IFXCIF_REG_H
#define IFXCIF_REG_H 1
/******************************************************************************/
#include "IfxCif_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Cif_Registers_Cfg_BaseAddress
 * \{  */

/** \brief CIF object */
#define MODULE_CIF /*lint --e(923, 9078)*/ ((*(Ifx_CIF*)0xFA001F00u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cif_Registers_Cfg_Cif
 * \{  */
/** \brief 0, Clock Control Register */
#define CIF_BBB_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_BBB_CLC*)0xFA001F00u)

/** \brief 4, Module Identification Register */
#define CIF_BBB_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_BBB_MODID*)0xFA001F04u)

/** \brief 8, General Purpose Control Register */
#define CIF_BBB_GPCTL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_BBB_GPCTL*)0xFA001F08u)

/** \brief C, Access Enable Register 0 */
#define CIF_BBB_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_BBB_ACCEN0*)0xFA001F0Cu)

/** \brief 10, Access Enable Register 1 */
#define CIF_BBB_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_BBB_ACCEN1*)0xFA001F10u)

/** \brief 14, Kernel Reset Register 0 */
#define CIF_BBB_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_BBB_KRST0*)0xFA001F14u)

/** \brief 18, Kernel Reset Register 1 */
#define CIF_BBB_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_BBB_KRST1*)0xFA001F18u)

/** \brief 1C, Kernel Reset Status Clear Register */
#define CIF_BBB_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_BBB_KRSTCLR*)0xFA001F1Cu)

/** \brief 0, Clock Control Register */
#define CIF_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_CCL*)0xFA002000u)

/** \brief 8, CIF Revision Identification Register */
#define CIF_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ID*)0xFA002008u)

/** \brief 10, CIF Internal Clock Control Register */
#define CIF_ICCL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ICCL*)0xFA002010u)

/** \brief 14, CIF Internal Reset Control Register */
#define CIF_IRCL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_IRCL*)0xFA002014u)

/** \brief 18, CIF Data Path Control Register */
#define CIF_DPCL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_DPCL*)0xFA002018u)

/** \brief 0, ISP Global Control Register */
#define CIF_ISP_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_CTRL*)0xFA002400u)

/** \brief 4, ISP Acquisition Properties Register */
#define CIF_ISP_ACQ_PROP /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ACQ_PROP*)0xFA002404u)

/** \brief 8, ISP Acquisition Horizontal Offset Register */
#define CIF_ISP_ACQ_H_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ACQ_H_OFFS*)0xFA002408u)

/** \brief C, ISP Acquistion Vertical Offset Register */
#define CIF_ISP_ACQ_V_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ACQ_V_OFFS*)0xFA00240Cu)

/** \brief 10, ISP Acquisition Horizontal Size Register */
#define CIF_ISP_ACQ_H_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ACQ_H_SIZE*)0xFA002410u)

/** \brief 14, ISP Acquisition Vertical Size Register */
#define CIF_ISP_ACQ_V_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ACQ_V_SIZE*)0xFA002414u)

/** \brief 18, ISP Acquisition Number of Frames Register */
#define CIF_ISP_ACQ_NR_FRAMES /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ACQ_NR_FRAMES*)0xFA002418u)

/** \brief 194, ISP Output Window Horizontal Offset Register */
#define CIF_ISP_OUT_H_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_OUT_H_OFFS*)0xFA002594u)

/** \brief 198, ISP Output Window Vertical Offset Register */
#define CIF_ISP_OUT_V_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_OUT_V_OFFS*)0xFA002598u)

/** \brief 19C, ISP Output Horizontal Picture Size Register */
#define CIF_ISP_OUT_H_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_OUT_H_SIZE*)0xFA00259Cu)

