dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_reg.h
/** \brief 80, Memory Interface Current Offset Counter of Main Picture Y Component JPEG or RAW Register */
#define CIF_MI_MP_Y_OFFS_CNT_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD*)0xFA003480u)

/** \brief 84, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Main Picture Y Register */
#define CIF_MI_MP_Y_IRQ_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD*)0xFA003484u)

/** \brief 88, Memory Interface Base Address Shadow Register For Main Picture Cb Component Ring Register */
#define CIF_MI_MP_CB_BASE_AD_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_BASE_AD_SHD*)0xFA003488u)

/** \brief 8C, Memory Interface Size Shadow Register Of Main Picture Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_SIZE_SHD*)0xFA00348Cu)

/** \brief 90, Memory Interface Current Offset Counter Of Main Picture Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD*)0xFA003490u)

/** \brief 94, Memory Interface Base Address Shadow Register For Main Picture Cr Component Ring Register */
#define CIF_MI_MP_CR_BASE_AD_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_BASE_AD_SHD*)0xFA003494u)

/** \brief 98, Memory Interface Size Shadow Register Of Main Picture Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_SIZE_SHD*)0xFA003498u)

/** \brief 9C, Memory Interface Current Offset Counter Of Main Picture Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD*)0xFA00349Cu)

/** \brief F8, MI Interrupt Mask \u20181\u2019 interrupt active \u20180\u2019 interrupt masked */
#define CIF_MI_IMSC /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_IMSC*)0xFA0034F8u)

/** \brief FC, MI Raw Interrupt Status Register */
#define CIF_MI_RIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_RIS*)0xFA0034FCu)

/** \brief 100, MI Masked Interrupt Status Registe */
#define CIF_MI_MIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MIS*)0xFA003500u)

/** \brief 104, MI Interrupt Clear Register */
#define CIF_MI_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_ICR*)0xFA003504u)

/** \brief 108, MI Interrupt Set Register */
#define CIF_MI_ISR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_ISR*)0xFA003508u)

/** \brief 10C, MI Status Register */
#define CIF_MI_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_STATUS*)0xFA00350Cu)

/** \brief 110, MI Status Clear Register */
#define CIF_MI_STATUS_CLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_STATUS_CLR*)0xFA003510u)

/** \brief 0, JPE Command To Start Stream Header Generation Register */
#define CIF_JPE_GEN_HEADER /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_GEN_HEADER*)0xFA003800u)

/** \brief 4, JPE Start Command To Start JFIF Stream Encoding Register */
#define CIF_JPE_ENCODE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ENCODE*)0xFA003804u)

/** \brief 8, JPE Automatic Configuration Update Register */
#define CIF_JPE_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_INIT*)0xFA003808u)

/** \brief C, JPE Y Value Scaling Control Register */
#define CIF_JPE_Y_SCALE_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_Y_SCALE_EN*)0xFA00380Cu)

/** \brief 10, JPE Cb/Cr Value Scaling Control Register */
#define CIF_JPE_CBCR_SCALE_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_CBCR_SCALE_EN*)0xFA003810u)

/** \brief 14, JPE Header Generation Debug Register */
#define CIF_JPE_TABLE_FLUSH /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TABLE_FLUSH*)0xFA003814u)

/** \brief 18, JPEG Codec Horizontal Image Size For Encoding Register */
#define CIF_JPE_ENC_HSIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ENC_HSIZE*)0xFA003818u)

/** \brief 1C, JPEG Codec Vertical Image Size For Encoding Register */
#define CIF_JPE_ENC_VSIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ENC_VSIZE*)0xFA00381Cu)

/** \brief 20, JPEG Picture Encoding Format Register */
#define CIF_JPE_PIC_FORMAT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_PIC_FORMAT*)0xFA003820u)

/** \brief 24, JPE Restart Marker Insertion Register */
#define CIF_JPE_RESTART_INTERVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_RESTART_INTERVAL*)0xFA003824u)

/** \brief 28, Q- table Selector 0, Quant. Table For Y Component */
#define CIF_JPE_TQ_Y_SELECT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TQ_Y_SELECT*)0xFA003828u)

/** \brief 2C, Q- table Selector 1, Quant. Table For U Component */
#define CIF_JPE_TQ_U_SELECT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TQ_U_SELECT*)0xFA00382Cu)

/** \brief 30, Q- table Selector 2 Quant Table For V Component */
#define CIF_JPE_TQ_V_SELECT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TQ_V_SELECT*)0xFA003830u)

/** \brief 34, JPE Huffman Table Selector For DC Values Register */
#define CIF_JPE_DC_TABLE_SELECT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_DC_TABLE_SELECT*)0xFA003834u)

/** \brief 38, JPE Huffman Table Selector For AC Values Register */
#define CIF_JPE_AC_TABLE_SELECT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_AC_TABLE_SELECT*)0xFA003838u)

/** \brief 3C, JPE Table Programming Register */
#define CIF_JPE_TABLE_DATA /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TABLE_DATA*)0xFA00383Cu)

/** \brief 40, JPE Table Programming Select Register */
#define CIF_JPE_TABLE_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TABLE_ID*)0xFA003840u)

/** \brief 44, JPE Huffman AC Table 0 Length Register */
#define CIF_JPE_TAC0_LEN /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TAC0_LEN*)0xFA003844u)

/** \brief 48, JPE Huffman DC Table 0 Length Register */
#define CIF_JPE_TDC0_LEN /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TDC0_LEN*)0xFA003848u)

/** \brief 4C, JPE Huffman AC Table 1 Length Register */
#define CIF_JPE_TAC1_LEN /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TAC1_LEN*)0xFA00384Cu)

/** \brief 50, JPE Huffman DC Table 1 Length Register */
#define CIF_JPE_TDC1_LEN /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_TDC1_LEN*)0xFA003850u)

/** \brief 58, JPE Encoder Status Flag Register */
#define CIF_JPE_ENCODER_BUSY /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ENCODER_BUSY*)0xFA003858u)

/** \brief 5C, JPE Header Mode Definition Register */
#define CIF_JPE_HEADER_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_HEADER_MODE*)0xFA00385Cu)

/** \brief 60, JPE Encode Mode Register */
#define CIF_JPE_ENCODE_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ENCODE_MODE*)0xFA003860u)

/** \brief 64, JPE Debug Information Register */
#define CIF_JPE_DEBUG /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_DEBUG*)0xFA003864u)

/** \brief 68, JPE Error Interrupt Mask Register */
#define CIF_JPE_ERROR_IMR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ERROR_IMR*)0xFA003868u)

/** \brief 6C, JPE Error Raw Interrupt Status Register */
#define CIF_JPE_ERROR_RIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ERROR_RIS*)0xFA00386Cu)

/** \brief 70, JPE Error Masked Interrupt Status Register */
#define CIF_JPE_ERROR_MIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ERROR_MIS*)0xFA003870u)

/** \brief 74, JPE Error Interrupt Clear Register */
#define CIF_JPE_ERROR_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ERROR_ICR*)0xFA003874u)

/** \brief 78, JPE Error Interrupt Set Register */
#define CIF_JPE_ERROR_ISR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_ERROR_ISR*)0xFA003878u)

/** \brief 7C, JPEG Status Interrupt Mask Register */
#define CIF_JPE_STATUS_IMR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_STATUS_IMR*)0xFA00387Cu)

/** \brief 80, JPEG Status Raw Interrupt Status Register */
#define CIF_JPE_STATUS_RIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_STATUS_RIS*)0xFA003880u)

/** \brief 84, JPEG Status Masked Interrupt Status Register */
#define CIF_JPE_STATUS_MIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_STATUS_MIS*)0xFA003884u)

/** \brief 88, JPEG Status Interrupt Clear Register */
#define CIF_JPE_STATUS_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_STATUS_ICR*)0xFA003888u)

/** \brief 8C, JPEG Status Interrupt Set Register */
#define CIF_JPE_STATUS_ISR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_STATUS_ISR*)0xFA00388Cu)

/** \brief 0, ISP Image Stabilization Control Register */
#define CIF_ISPIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISPIS_CTRL*)0xFA004300u)

