dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_reg.h
/** \brief 324, Extra Path 3 Image Cropping Current Horizontal Offset of Output Window Shadow Register */
#define CIF_EP3_IC_H_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS_SHD*)0xFA004C24u)
/** Alias (User Manual Name) for CIF_EP3_IC_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP3_IC_H_OFFS_SHD.
*/
#define CIF_EP_3_IC_H_OFFS_SHD (CIF_EP3_IC_H_OFFS_SHD)

/** \brief 328, Extra Path 3 Image Cropping Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP3_IC_V_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS_SHD*)0xFA004C28u)
/** Alias (User Manual Name) for CIF_EP3_IC_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP3_IC_V_OFFS_SHD.
*/
#define CIF_EP_3_IC_V_OFFS_SHD (CIF_EP3_IC_V_OFFS_SHD)

/** \brief 32C, Extra Path 3 Image Cropping Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP3_IC_H_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE_SHD*)0xFA004C2Cu)
/** Alias (User Manual Name) for CIF_EP3_IC_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP3_IC_H_SIZE_SHD.
*/
#define CIF_EP_3_IC_H_SIZE_SHD (CIF_EP3_IC_H_SIZE_SHD)

/** \brief 330, Extra Path 3 Image Cropping Current Output Vertical Picture Size Shadow Register */
#define CIF_EP3_IC_V_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE_SHD*)0xFA004C30u)
/** Alias (User Manual Name) for CIF_EP3_IC_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP3_IC_V_SIZE_SHD.
*/
#define CIF_EP_3_IC_V_SIZE_SHD (CIF_EP3_IC_V_SIZE_SHD)

/** \brief 400, Extra Path 4 Image Cropping Control Register */
#define CIF_EP4_IC_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_CTRL*)0xFA004D00u)
/** Alias (User Manual Name) for CIF_EP4_IC_CTRL.
* To use register names with standard convension, please use CIF_EP4_IC_CTRL.
*/
#define CIF_EP_4_IC_CTRL (CIF_EP4_IC_CTRL)

/** \brief 404, Extra Path 4 Image Cropping Recenter Register */
#define CIF_EP4_IC_RECENTER /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_RECENTER*)0xFA004D04u)
/** Alias (User Manual Name) for CIF_EP4_IC_RECENTER.
* To use register names with standard convension, please use CIF_EP4_IC_RECENTER.
*/
#define CIF_EP_4_IC_RECENTER (CIF_EP4_IC_RECENTER)

/** \brief 408, Extra Path 4 Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP4_IC_H_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS*)0xFA004D08u)
/** Alias (User Manual Name) for CIF_EP4_IC_H_OFFS.
* To use register names with standard convension, please use CIF_EP4_IC_H_OFFS.
*/
#define CIF_EP_4_IC_H_OFFS (CIF_EP4_IC_H_OFFS)

/** \brief 40C, Extra Path 4 Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP4_IC_V_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS*)0xFA004D0Cu)
/** Alias (User Manual Name) for CIF_EP4_IC_V_OFFS.
* To use register names with standard convension, please use CIF_EP4_IC_V_OFFS.
*/
#define CIF_EP_4_IC_V_OFFS (CIF_EP4_IC_V_OFFS)

/** \brief 410, Extra Path 4 Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP4_IC_H_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE*)0xFA004D10u)
/** Alias (User Manual Name) for CIF_EP4_IC_H_SIZE.
* To use register names with standard convension, please use CIF_EP4_IC_H_SIZE.
*/
#define CIF_EP_4_IC_H_SIZE (CIF_EP4_IC_H_SIZE)

/** \brief 414, Extra Path 4 Image Cropping Output Vertical Picture Size Register */
#define CIF_EP4_IC_V_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE*)0xFA004D14u)
/** Alias (User Manual Name) for CIF_EP4_IC_V_SIZE.
* To use register names with standard convension, please use CIF_EP4_IC_V_SIZE.
*/
#define CIF_EP_4_IC_V_SIZE (CIF_EP4_IC_V_SIZE)

/** \brief 418, Extra Path 4 Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP4_IC_MAX_DX /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DX*)0xFA004D18u)
/** Alias (User Manual Name) for CIF_EP4_IC_MAX_DX.
* To use register names with standard convension, please use CIF_EP4_IC_MAX_DX.
*/
#define CIF_EP_4_IC_MAX_DX (CIF_EP4_IC_MAX_DX)

/** \brief 41C, Extra Path 4 Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP4_IC_MAX_DY /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DY*)0xFA004D1Cu)
/** Alias (User Manual Name) for CIF_EP4_IC_MAX_DY.
* To use register names with standard convension, please use CIF_EP4_IC_MAX_DY.
*/
#define CIF_EP_4_IC_MAX_DY (CIF_EP4_IC_MAX_DY)

/** \brief 420, Extra Path 4 Image Cropping Camera Displacement Register */
#define CIF_EP4_IC_DISPLACE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_DISPLACE*)0xFA004D20u)
/** Alias (User Manual Name) for CIF_EP4_IC_DISPLACE.
* To use register names with standard convension, please use CIF_EP4_IC_DISPLACE.
*/
#define CIF_EP_4_IC_DISPLACE (CIF_EP4_IC_DISPLACE)

/** \brief 424, Extra Path 4 Image Cropping Current Horizontal Offset of Output Window Shadow Register */
#define CIF_EP4_IC_H_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS_SHD*)0xFA004D24u)
/** Alias (User Manual Name) for CIF_EP4_IC_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP4_IC_H_OFFS_SHD.
*/
#define CIF_EP_4_IC_H_OFFS_SHD (CIF_EP4_IC_H_OFFS_SHD)

/** \brief 428, Extra Path 4 Image Cropping Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP4_IC_V_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS_SHD*)0xFA004D28u)
/** Alias (User Manual Name) for CIF_EP4_IC_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP4_IC_V_OFFS_SHD.
*/
#define CIF_EP_4_IC_V_OFFS_SHD (CIF_EP4_IC_V_OFFS_SHD)

/** \brief 42C, Extra Path 4 Image Cropping Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP4_IC_H_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE_SHD*)0xFA004D2Cu)
/** Alias (User Manual Name) for CIF_EP4_IC_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP4_IC_H_SIZE_SHD.
*/
#define CIF_EP_4_IC_H_SIZE_SHD (CIF_EP4_IC_H_SIZE_SHD)

/** \brief 430, Extra Path 4 Image Cropping Current Output Vertical Picture Size Shadow Register */
#define CIF_EP4_IC_V_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE_SHD*)0xFA004D30u)
/** Alias (User Manual Name) for CIF_EP4_IC_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP4_IC_V_SIZE_SHD.
*/
#define CIF_EP_4_IC_V_SIZE_SHD (CIF_EP4_IC_V_SIZE_SHD)

