dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_reg.h
/** \brief 0, Extra Path Error Register */
#define CIF_MIEP_STA_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_STA_ERR*)0xFA005400u)

/** \brief 4, Extra Path Status Error Clear Register */
#define CIF_MIEP_STA_ERR_CLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_STA_ERR_CLR*)0xFA005404u)

/** \brief 8, MI Extra Path Interrupt Mask \u20181\u2019: interrupt active, \u20180\u2019: interrupt masked */
#define CIF_MIEP_IMSC /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_IMSC*)0xFA005408u)

/** \brief C, MI Extra Path Raw Interrupt Status Register */
#define CIF_MIEP_RIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_RIS*)0xFA00540Cu)

/** \brief 10, MI Extra Path Masked Interrupt Status Register */
#define CIF_MIEP_MIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_MIS*)0xFA005410u)

/** \brief 14, MI Extra Path Interrupt Clear Register */
#define CIF_MIEP_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_ICR*)0xFA005414u)

/** \brief 18, MI Extra Path Interrupt Set Register */
#define CIF_MIEP_ISR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_ISR*)0xFA005418u)

/** \brief 100, Memory Interface Extra Path 0 Control Register */
#define CIF_MIEP_CH_1S0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL*)0xFA005500u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_CTRL.
*/
#define CIF_MIEP_0_CTRL (CIF_MIEP_CH_1S0_CTRL)

/** \brief 104, Memory Interface Extra Path 0 Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_CH_1S0_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_INIT*)0xFA005504u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_INIT.
*/
#define CIF_MIEP_0_INIT (CIF_MIEP_CH_1S0_INIT)

/** \brief 108, Memory Interface Base Address for Extra Path 0 Data Buffer Register */
#define CIF_MIEP_CH_1S0_BASE_AD_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT*)0xFA005508u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_BASE_AD_INIT.
*/
#define CIF_MIEP_0_BASE_AD_INIT (CIF_MIEP_CH_1S0_BASE_AD_INIT)

/** \brief 10C, Memory Interface Size of Extra Path 0 Data Buffer Register */
#define CIF_MIEP_CH_1S0_SIZE_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_INIT*)0xFA00550Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_SIZE_INIT.
*/
#define CIF_MIEP_0_SIZE_INIT (CIF_MIEP_CH_1S0_SIZE_INIT)

/** \brief 110, Memory Interface Offset Counter Init Value For Extra Path 0 Buffer Register */
#define CIF_MIEP_CH_1S0_OFFS_CNT_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT*)0xFA005510u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_OFFS_CNT_INIT.
*/
#define CIF_MIEP_0_OFFS_CNT_INIT (CIF_MIEP_CH_1S0_OFFS_CNT_INIT)

/** \brief 114, Memory Interface Offset Counter Start Value for Extra Path 0 Register */
#define CIF_MIEP_CH_1S0_OFFS_CNT_START /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START*)0xFA005514u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_OFFS_CNT_START.
*/
#define CIF_MIEP_0_OFFS_CNT_START (CIF_MIEP_CH_1S0_OFFS_CNT_START)

/** \brief 118, Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register */
#define CIF_MIEP_CH_1S0_IRQ_OFFS_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT*)0xFA005518u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_IRQ_OFFS_INIT.
*/
#define CIF_MIEP_0_IRQ_OFFS_INIT (CIF_MIEP_CH_1S0_IRQ_OFFS_INIT)

/** \brief 11C, Memory Interface Extra Path 0 Control Internal Shadow Register */
#define CIF_MIEP_CH_1S0_CTRL_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL_SHD*)0xFA00551Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_CTRL_SHD.
*/
#define CIF_MIEP_0_CTRL_SHD (CIF_MIEP_CH_1S0_CTRL_SHD)

/** \brief 120, Memory Interface Base Address Shadow Register for Extra Path 0 Buffer Register */
#define CIF_MIEP_CH_1S0_BASE_AD_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD*)0xFA005520u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_BASE_AD_SHD.
*/
#define CIF_MIEP_0_BASE_AD_SHD (CIF_MIEP_CH_1S0_BASE_AD_SHD)

/** \brief 124, Memory Interface Size Shadow Register of Extra Path 0 Buffer Register */
#define CIF_MIEP_CH_1S0_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_SHD*)0xFA005524u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_SIZE_SHD.
*/
#define CIF_MIEP_0_SIZE_SHD (CIF_MIEP_CH_1S0_SIZE_SHD)

/** \brief 128, Memory Interface Current Offset Counter of Extra Path 0 Buffer Register */
#define CIF_MIEP_CH_1S0_OFFS_CNT_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD*)0xFA005528u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_OFFS_CNT_SHD.
*/
#define CIF_MIEP_0_OFFS_CNT_SHD (CIF_MIEP_CH_1S0_OFFS_CNT_SHD)

/** \brief 12C, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path 0 Register */
#define CIF_MIEP_CH_1S0_IRQ_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD*)0xFA00552Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_IRQ_OFFS_SHD.
*/
#define CIF_MIEP_0_IRQ_OFFS_SHD (CIF_MIEP_CH_1S0_IRQ_OFFS_SHD)

/** \brief 200, Memory Interface Extra Path 1 Control Register */
#define CIF_MIEP_CH_1S1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL*)0xFA005600u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_CTRL.
*/
#define CIF_MIEP_1_CTRL (CIF_MIEP_CH_1S1_CTRL)

/** \brief 204, Memory Interface Extra Path 1 Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_CH_1S1_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_INIT*)0xFA005604u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_INIT.
*/
#define CIF_MIEP_1_INIT (CIF_MIEP_CH_1S1_INIT)

/** \brief 208, Memory Interface Base Address for Extra Path 1 Data Buffer Register */
#define CIF_MIEP_CH_1S1_BASE_AD_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT*)0xFA005608u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_BASE_AD_INIT.
*/
#define CIF_MIEP_1_BASE_AD_INIT (CIF_MIEP_CH_1S1_BASE_AD_INIT)

/** \brief 20C, Memory Interface Size of Extra Path 1 Data Buffer Register */
#define CIF_MIEP_CH_1S1_SIZE_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_INIT*)0xFA00560Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_SIZE_INIT.
*/
#define CIF_MIEP_1_SIZE_INIT (CIF_MIEP_CH_1S1_SIZE_INIT)

/** \brief 210, Memory Interface Offset Counter Init Value For Extra Path 1 Buffer Register */
#define CIF_MIEP_CH_1S1_OFFS_CNT_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT*)0xFA005610u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_OFFS_CNT_INIT.
*/
#define CIF_MIEP_1_OFFS_CNT_INIT (CIF_MIEP_CH_1S1_OFFS_CNT_INIT)

/** \brief 214, Memory Interface Offset Counter Start Value for Extra Path 1 Register */
#define CIF_MIEP_CH_1S1_OFFS_CNT_START /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START*)0xFA005614u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_OFFS_CNT_START.
*/
#define CIF_MIEP_1_OFFS_CNT_START (CIF_MIEP_CH_1S1_OFFS_CNT_START)

/** \brief 218, Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register */
#define CIF_MIEP_CH_1S1_IRQ_OFFS_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT*)0xFA005618u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_IRQ_OFFS_INIT.
*/
#define CIF_MIEP_1_IRQ_OFFS_INIT (CIF_MIEP_CH_1S1_IRQ_OFFS_INIT)

