dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_reg.h
/** \brief 50C, Memory Interface Size of Extra Path 4 Data Buffer Register */
#define CIF_MIEP_CH_1S4_SIZE_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_INIT*)0xFA00590Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_SIZE_INIT.
*/
#define CIF_MIEP_4_SIZE_INIT (CIF_MIEP_CH_1S4_SIZE_INIT)

/** \brief 510, Memory Interface Offset Counter Init Value For Extra Path 4 Buffer Register */
#define CIF_MIEP_CH_1S4_OFFS_CNT_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT*)0xFA005910u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_OFFS_CNT_INIT.
*/
#define CIF_MIEP_4_OFFS_CNT_INIT (CIF_MIEP_CH_1S4_OFFS_CNT_INIT)

/** \brief 514, Memory Interface Offset Counter Start Value for Extra Path 4 Register */
#define CIF_MIEP_CH_1S4_OFFS_CNT_START /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START*)0xFA005914u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_OFFS_CNT_START.
*/
#define CIF_MIEP_4_OFFS_CNT_START (CIF_MIEP_CH_1S4_OFFS_CNT_START)

/** \brief 518, Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register */
#define CIF_MIEP_CH_1S4_IRQ_OFFS_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT*)0xFA005918u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_IRQ_OFFS_INIT.
*/
#define CIF_MIEP_4_IRQ_OFFS_INIT (CIF_MIEP_CH_1S4_IRQ_OFFS_INIT)

/** \brief 51C, Memory Interface Extra Path 4 Control Internal Shadow Register */
#define CIF_MIEP_CH_1S4_CTRL_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL_SHD*)0xFA00591Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_CTRL_SHD.
*/
#define CIF_MIEP_4_CTRL_SHD (CIF_MIEP_CH_1S4_CTRL_SHD)

/** \brief 520, Memory Interface Base Address Shadow Register for Extra Path 4 Buffer Register */
#define CIF_MIEP_CH_1S4_BASE_AD_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD*)0xFA005920u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_BASE_AD_SHD.
*/
#define CIF_MIEP_4_BASE_AD_SHD (CIF_MIEP_CH_1S4_BASE_AD_SHD)

/** \brief 524, Memory Interface Size Shadow Register of Extra Path 4 Buffer Register */
#define CIF_MIEP_CH_1S4_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_SHD*)0xFA005924u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_SIZE_SHD.
*/
#define CIF_MIEP_4_SIZE_SHD (CIF_MIEP_CH_1S4_SIZE_SHD)

/** \brief 528, Memory Interface Current Offset Counter of Extra Path 4 Buffer Register */
#define CIF_MIEP_CH_1S4_OFFS_CNT_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD*)0xFA005928u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_OFFS_CNT_SHD.
*/
#define CIF_MIEP_4_OFFS_CNT_SHD (CIF_MIEP_CH_1S4_OFFS_CNT_SHD)

/** \brief 52C, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path 4 Register */
#define CIF_MIEP_CH_1S4_IRQ_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD*)0xFA00592Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_IRQ_OFFS_SHD.
*/
#define CIF_MIEP_4_IRQ_OFFS_SHD (CIF_MIEP_CH_1S4_IRQ_OFFS_SHD)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXCIF_REG_H */
